RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/drivers/drv_uart_v2.c
#if defined(BSP_USING_LPUART1)
void LPUART1_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART1_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART2)
void LPUART2_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART2_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART3)
void LPUART3_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART3_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART4)
void LPUART4_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART4_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART5)
void LPUART5_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART5_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART6)
void LPUART6_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART6_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART7)
void LPUART7_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART7_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART8)
void LPUART8_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART8_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART10)
void LPUART10_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART10_INDEX]);
    rt_interrupt_leave();
}
#endif

#if defined(BSP_USING_LPUART12)
void LPUART12_IRQHandler(void)
{
    rt_interrupt_enter();
    uart_isr(&uarts[LPUART12_INDEX]);
    rt_interrupt_leave();
}
#endif

static void uart_isr(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);

    /* Check and clear overrun first: when overrun is set, the RX data register
     * content is unreliable on LPUART. Clear before reading to avoid consuming
     * a corrupted byte. */
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxOverrunFlag)
    {
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_RxOverrunFlag);
    }
    else if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        uint8_t ch = LPUART_ReadByte(uart->uart_base);
        rt_hw_serial_control_isr(&uart->serial, RT_HW_SERIAL_CTRL_PUTC, &ch);
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_IND);
    }

    if ((LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TxDataRegEmptyFlag) &&
        (LPUART_GetEnabledInterrupts(uart->uart_base) & kLPUART_TxDataRegEmptyInterruptEnable))
    {
        /* Feed the next byte from the Serial V2 ring buffer into the TX register.
         * If the ring buffer is empty, disable the TX interrupt and signal TX_DONE
         * so the Serial V2 framework can unblock the waiting writer. */
        uint8_t tx_ch;
        if (rt_hw_serial_control_isr(&uart->serial, RT_HW_SERIAL_CTRL_GETC, &tx_ch) == RT_EOK)
        {
            LPUART_WriteByte(uart->uart_base, tx_ch);
        }
        else
        {
            LPUART_DisableInterrupts(uart->uart_base, kLPUART_TxDataRegEmptyInterruptEnable);
            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_TX_DONE);
        }
    }

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    if ((LPUART_GetStatusFlags(uart->uart_base) & kLPUART_IdleLineFlag) && (uart->dma_rx != RT_NULL))
    {
        LPUART_ClearStatusFlags(uart->uart_base, kLPUART_IdleLineFlag);
        rt_size_t recv_len;
        rt_base_t level;
        level = rt_hw_interrupt_disable();
        {
            edma_handle_t *edma_h = &uart->dma_rx->edma;
            rt_size_t total_index = EDMA_TCD_CITER(&edma_h->tcdBase[edma_h->channel], EDMA_TCD_TYPE(edma_h->base)) & 0x7FFFU;
            total_index = uart->serial.config.dma_ping_bufsz - total_index;
            if (total_index > uart->dma_rx->last_index)
                recv_len = total_index - uart->dma_rx->last_index;
            else if (total_index < uart->dma_rx->last_index)
                recv_len = total_index + (uart->serial.config.dma_ping_bufsz - uart->dma_rx->last_index);
            else
                recv_len = 0;
            uart->dma_rx->last_index = total_index;
        }
        rt_hw_interrupt_enable(level);

        if (recv_len > 0)
        {
            if (recv_len > uart->serial.config.dma_ping_bufsz)
                recv_len = uart->serial.config.dma_ping_bufsz;
            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
    }
#endif
}

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
void edma_rx_callback(struct _edma_handle *handle, void *userData, bool transferDone, uint32_t tcds)
{
    rt_size_t recv_len = 0;
    rt_base_t level;
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (transferDone)
    {
        level = rt_hw_interrupt_disable();
        if ((EDMA_GetChannelStatusFlags(uart->dma_rx->edma_base, uart->dma_rx->channel) & kEDMA_DoneFlag) != 0U)
        {
            EDMA_ClearChannelStatusFlags(uart->dma_rx->edma_base, uart->dma_rx->channel, kEDMA_DoneFlag);
            recv_len = uart->serial.config.dma_ping_bufsz - uart->dma_rx->last_index;
            uart->dma_rx->last_index = 0;
        }
        else
        {
            EDMA_ClearChannelStatusFlags(uart->dma_rx->edma_base, uart->dma_rx->channel, kEDMA_InterruptFlag);
            rt_size_t total_index = EDMA_TCD_CITER(&handle->tcdBase[handle->channel], EDMA_TCD_TYPE(handle->base)) & 0x7FFFU;
            total_index = uart->serial.config.dma_ping_bufsz - total_index;
            if (total_index > uart->dma_rx->last_index)
                recv_len = total_index - uart->dma_rx->last_index;
            else
                recv_len = total_index + (uart->serial.config.dma_ping_bufsz - uart->dma_rx->last_index);
            uart->dma_rx->last_index = total_index;
        }
        rt_hw_interrupt_enable(level);

        if (recv_len)
        {
            if (recv_len > uart->serial.config.dma_ping_bufsz)
                recv_len = uart->serial.config.dma_ping_bufsz;
            rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_RX_DMADONE | (recv_len << 8));
        }
    }
}

void edma_tx_callback(LPUART_Type *base, lpuart_edma_handle_t *handle, status_t status, void *userData)
{
    struct imxrt_uart *uart = (struct imxrt_uart *)userData;
    RT_ASSERT(uart != RT_NULL);

    if (kStatus_LPUART_TxIdle == status)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_TX_DMADONE);
    }
}

#ifdef SOC_IMXRT1180_SERIES
static void imxrt_edma_mux_setup(EDMA_Type *base, rt_uint8_t channel, dma_request_source_t request)
{
    EDMA_SetChannelMux(base, channel, request);
}
#else
static void imxrt_edma_mux_setup(EDMA_Type *base, rt_uint8_t channel, dma_request_source_t request)
{
    (void)base;
    DMAMUX_SetSource(DMAMUX, channel, request);
    DMAMUX_EnableChannel(DMAMUX, channel);
}
#endif

static void imxrt_dma_rx_config(struct imxrt_uart *uart)
{
    RT_ASSERT(uart != RT_NULL);
    edma_transfer_config_t xferConfig;
    EDMA_Type *base = uart->dma_rx->edma_base;

