RT-Thread/rt-thread/bsp/nxp/imx/imxrt/libraries/drivers/drv_uart_v2.c
    return RT_EOK;
}

static int imxrt_putc(struct rt_serial_device *serial, char ch)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    LPUART_WriteByte(uart->uart_base, ch);
    while (!(LPUART_GetStatusFlags(uart->uart_base) & kLPUART_TxDataRegEmptyFlag))
        ;

    return 1;
}

static int imxrt_getc(struct rt_serial_device *serial)
{
    int ch;
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

    ch = -1;
    if (LPUART_GetStatusFlags(uart->uart_base) & kLPUART_RxDataRegFullFlag)
    {
        ch = LPUART_ReadByte(uart->uart_base);
    }

    return ch;
}

static rt_ssize_t imxrt_transmit(struct rt_serial_device *serial,
                                 rt_uint8_t *buf, rt_size_t size, rt_uint32_t tx_flag)
{
    struct imxrt_uart *uart;

    RT_ASSERT(serial != RT_NULL);
    uart = rt_container_of(serial, struct imxrt_uart, serial);

#if defined(RT_SERIAL_USING_DMA) && defined(BSP_USING_DMA)
    if (uart->dma_flag & RT_DEVICE_FLAG_DMA_TX)
    {
        lpuart_transfer_t xfer;
        RT_ASSERT(buf != RT_NULL);
        xfer.data = buf;
        xfer.dataSize = size;
        if (LPUART_SendEDMA(uart->uart_base, &uart->dma_tx->uart_edma, &xfer) == kStatus_Success)
            return (rt_ssize_t)size;
        return -RT_EIO;
    }
#endif

    /* Interrupt TX path: the Serial V2 framework has already placed data into the
     * TX ring buffer before calling transmit(). Enable the TX-empty interrupt so
     * uart_isr will drain the ring buffer byte by byte via RT_HW_SERIAL_CTRL_GETC
     * and fire RT_SERIAL_EVENT_TX_DONE when the buffer is empty.
     * Return size immediately so the framework knows the transfer was accepted. */
    LPUART_EnableInterrupts(uart->uart_base, kLPUART_TxDataRegEmptyInterruptEnable);
    return (rt_ssize_t)size;
}

static const struct rt_uart_ops imxrt_uart_ops = {
    imxrt_configure,
    imxrt_control,
    imxrt_putc,
    imxrt_getc,
    imxrt_transmit,
};

int rt_hw_uart_init(void)
{
    int i;
    rt_err_t ret = RT_EOK;
    struct serial_configure config = RT_SERIAL_CONFIG_DEFAULT;

    uart_get_dma_config();

    for (i = 0; i < sizeof(uarts) / sizeof(uarts[0]); i++)
    {
        uarts[i].serial.ops = &imxrt_uart_ops;
        uarts[i].serial.config = config;

        ret = rt_hw_serial_register(&uarts[i].serial, uarts[i].name,
                                    RT_DEVICE_FLAG_RDWR, NULL);
    }

    return ret;
}
INIT_BOARD_EXPORT(rt_hw_uart_init);

#endif /* BSP_USING_LPUART */
#endif /* RT_USING_SERIAL_V2 */
